PARAMETER ...
Namespace(batch_size=480, curveml_dataset=True, gpu='0', gt_column='trans_x', log_dir='pointnet-nonormal-curveml-regression-trans_x-bs480/2023-11-25_22-43', mnist_dataset=False, num_classes=1, num_point=1024, num_votes=3, show_one_batch=False, show_predictions=False, use_cpu=False, use_normals=False, use_uniform_sample=False, y_range_max=0.8, y_range_min=-0.8)
Loading the CurveML dataset...
Using column: trans_x as ground truth...
.Warning: using only test set for dataloaders...
. DONE!
testDataLoader size: 117
Received y_range: [-0.8, 0.8] with type: <class 'float'> - <class 'float'>
one_batch: 2 - torch.Size([480, 400, 3])
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
get_model                                [480, 1]                  --
├─PointNetEncoder: 1-1                   [480, 1024]               --
│    └─STN3d: 2-1                        [480, 3, 3]               --
│    │    └─Conv1d: 3-1                  [480, 64, 400]            256
│    │    └─BatchNorm1d: 3-2             [480, 64, 400]            128
│    │    └─Conv1d: 3-3                  [480, 128, 400]           8,320
│    │    └─BatchNorm1d: 3-4             [480, 128, 400]           256
│    │    └─Conv1d: 3-5                  [480, 1024, 400]          132,096
│    │    └─BatchNorm1d: 3-6             [480, 1024, 400]          2,048
│    │    └─Linear: 3-7                  [480, 512]                524,800
│    │    └─BatchNorm1d: 3-8             [480, 512]                1,024
│    │    └─Linear: 3-9                  [480, 256]                131,328
│    │    └─BatchNorm1d: 3-10            [480, 256]                512
│    │    └─Linear: 3-11                 [480, 9]                  2,313
│    └─Conv1d: 2-2                       [480, 64, 400]            256
│    └─BatchNorm1d: 2-3                  [480, 64, 400]            128
│    └─STNkd: 2-4                        [480, 64, 64]             --
│    │    └─Conv1d: 3-12                 [480, 64, 400]            4,160
│    │    └─BatchNorm1d: 3-13            [480, 64, 400]            128
│    │    └─Conv1d: 3-14                 [480, 128, 400]           8,320
│    │    └─BatchNorm1d: 3-15            [480, 128, 400]           256
│    │    └─Conv1d: 3-16                 [480, 1024, 400]          132,096
│    │    └─BatchNorm1d: 3-17            [480, 1024, 400]          2,048
│    │    └─Linear: 3-18                 [480, 512]                524,800
│    │    └─BatchNorm1d: 3-19            [480, 512]                1,024
│    │    └─Linear: 3-20                 [480, 256]                131,328
│    │    └─BatchNorm1d: 3-21            [480, 256]                512
│    │    └─Linear: 3-22                 [480, 4096]               1,052,672
│    └─Conv1d: 2-5                       [480, 128, 400]           8,320
│    └─BatchNorm1d: 2-6                  [480, 128, 400]           256
│    └─Conv1d: 2-7                       [480, 1024, 400]          132,096
│    └─BatchNorm1d: 2-8                  [480, 1024, 400]          2,048
├─Linear: 1-2                            [480, 512]                524,800
├─BatchNorm1d: 1-3                       [480, 512]                1,024
├─Linear: 1-4                            [480, 256]                131,328
├─Dropout: 1-5                           [480, 256]                --
├─BatchNorm1d: 1-6                       [480, 256]                512
├─Linear: 1-7                            [480, 1]                  257
├─SigmoidRange: 1-8                      [480, 1]                  --
==========================================================================================
Total params: 3,461,450
Trainable params: 3,461,450
Non-trainable params: 0
Total mult-adds (G): 83.23
==========================================================================================
Input size (MB): 2.30
Forward/backward pass size (MB): 11240.12
Params size (MB): 13.85
Estimated Total Size (MB): 11256.27
==========================================================================================
  0%|          | 0/117 [00:00<?, ?it/s]  1%|          | 1/117 [00:00<00:17,  6.63it/s]  2%|▏         | 2/117 [00:00<00:16,  6.85it/s]  3%|▎         | 3/117 [00:00<00:16,  7.01it/s]  3%|▎         | 4/117 [00:00<00:15,  7.12it/s]  4%|▍         | 5/117 [00:00<00:15,  7.18it/s]  5%|▌         | 6/117 [00:00<00:16,  6.66it/s]  6%|▌         | 7/117 [00:01<00:16,  6.86it/s]  7%|▋         | 8/117 [00:01<00:15,  6.98it/s]  8%|▊         | 9/117 [00:01<00:15,  7.07it/s]  9%|▊         | 10/117 [00:01<00:15,  7.12it/s]  9%|▉         | 11/117 [00:01<00:14,  7.18it/s] 10%|█         | 12/117 [00:01<00:14,  7.22it/s] 11%|█         | 13/117 [00:01<00:14,  7.24it/s] 12%|█▏        | 14/117 [00:01<00:14,  7.22it/s] 13%|█▎        | 15/117 [00:02<00:14,  7.24it/s] 14%|█▎        | 16/117 [00:02<00:13,  7.25it/s] 15%|█▍        | 17/117 [00:02<00:13,  7.27it/s] 15%|█▌        | 18/117 [00:02<00:13,  7.28it/s] 16%|█▌        | 19/117 [00:02<00:13,  7.27it/s] 17%|█▋        | 20/117 [00:02<00:13,  7.27it/s] 18%|█▊        | 21/117 [00:02<00:13,  7.27it/s] 19%|█▉        | 22/117 [00:03<00:13,  7.23it/s] 20%|█▉        | 23/117 [00:03<00:13,  7.22it/s] 21%|██        | 24/117 [00:03<00:12,  7.25it/s] 21%|██▏       | 25/117 [00:03<00:12,  7.27it/s] 22%|██▏       | 26/117 [00:03<00:12,  7.27it/s] 23%|██▎       | 27/117 [00:03<00:12,  7.28it/s] 24%|██▍       | 28/117 [00:03<00:12,  7.30it/s] 25%|██▍       | 29/117 [00:04<00:12,  7.26it/s] 26%|██▌       | 30/117 [00:04<00:11,  7.26it/s] 26%|██▋       | 31/117 [00:04<00:11,  7.27it/s] 27%|██▋       | 32/117 [00:04<00:11,  7.29it/s] 28%|██▊       | 33/117 [00:04<00:11,  7.28it/s] 29%|██▉       | 34/117 [00:04<00:11,  7.27it/s] 30%|██▉       | 35/117 [00:04<00:11,  7.28it/s] 31%|███       | 36/117 [00:05<00:11,  7.28it/s] 32%|███▏      | 37/117 [00:05<00:11,  7.22it/s] 32%|███▏      | 38/117 [00:05<00:11,  6.99it/s] 33%|███▎      | 39/117 [00:05<00:11,  6.80it/s] 34%|███▍      | 40/117 [00:05<00:11,  6.75it/s] 35%|███▌      | 41/117 [00:05<00:11,  6.87it/s] 36%|███▌      | 42/117 [00:05<00:11,  6.73it/s] 37%|███▋      | 43/117 [00:06<00:10,  6.84it/s] 38%|███▊      | 44/117 [00:06<00:10,  6.96it/s] 38%|███▊      | 45/117 [00:06<00:10,  7.04it/s] 39%|███▉      | 46/117 [00:06<00:10,  7.10it/s] 40%|████      | 47/117 [00:06<00:09,  7.15it/s] 41%|████      | 48/117 [00:06<00:09,  7.19it/s] 42%|████▏     | 49/117 [00:06<00:09,  7.22it/s] 43%|████▎     | 50/117 [00:07<00:09,  7.24it/s] 44%|████▎     | 51/117 [00:07<00:09,  7.25it/s] 44%|████▍     | 52/117 [00:07<00:08,  7.25it/s] 45%|████▌     | 53/117 [00:07<00:08,  7.26it/s] 46%|████▌     | 54/117 [00:07<00:08,  7.23it/s] 47%|████▋     | 55/117 [00:07<00:08,  7.25it/s] 48%|████▊     | 56/117 [00:07<00:08,  7.25it/s] 49%|████▊     | 57/117 [00:07<00:08,  7.22it/s] 50%|████▉     | 58/117 [00:08<00:08,  7.23it/s] 50%|█████     | 59/117 [00:08<00:08,  7.25it/s] 51%|█████▏    | 60/117 [00:08<00:07,  7.25it/s] 52%|█████▏    | 61/117 [00:08<00:07,  7.26it/s] 53%|█████▎    | 62/117 [00:08<00:07,  7.26it/s] 54%|█████▍    | 63/117 [00:08<00:07,  7.25it/s] 55%|█████▍    | 64/117 [00:08<00:07,  7.25it/s] 56%|█████▌    | 65/117 [00:09<00:07,  7.27it/s] 56%|█████▋    | 66/117 [00:09<00:07,  7.25it/s] 57%|█████▋    | 67/117 [00:09<00:06,  7.26it/s] 58%|█████▊    | 68/117 [00:09<00:06,  7.24it/s] 59%|█████▉    | 69/117 [00:09<00:06,  7.26it/s] 60%|█████▉    | 70/117 [00:09<00:06,  7.26it/s] 61%|██████    | 71/117 [00:09<00:06,  7.27it/s] 62%|██████▏   | 72/117 [00:10<00:06,  7.28it/s] 62%|██████▏   | 73/117 [00:10<00:06,  7.27it/s] 63%|██████▎   | 74/117 [00:10<00:05,  7.23it/s] 64%|██████▍   | 75/117 [00:10<00:05,  7.24it/s] 65%|██████▍   | 76/117 [00:10<00:05,  7.26it/s] 66%|██████▌   | 77/117 [00:10<00:05,  7.24it/s] 67%|██████▋   | 78/117 [00:10<00:05,  7.24it/s] 68%|██████▊   | 79/117 [00:11<00:05,  7.25it/s] 68%|██████▊   | 80/117 [00:11<00:05,  7.26it/s] 69%|██████▉   | 81/117 [00:11<00:04,  7.26it/s] 70%|███████   | 82/117 [00:11<00:04,  7.13it/s] 71%|███████   | 83/117 [00:11<00:04,  7.16it/s] 72%|███████▏  | 84/117 [00:11<00:04,  7.13it/s] 73%|███████▎  | 85/117 [00:11<00:04,  6.91it/s] 74%|███████▎  | 86/117 [00:11<00:04,  7.02it/s] 74%|███████▍  | 87/117 [00:12<00:04,  7.08it/s] 75%|███████▌  | 88/117 [00:12<00:04,  7.13it/s] 76%|███████▌  | 89/117 [00:12<00:03,  7.18it/s] 77%|███████▋  | 90/117 [00:12<00:03,  7.20it/s] 78%|███████▊  | 91/117 [00:12<00:03,  7.23it/s] 79%|███████▊  | 92/117 [00:12<00:03,  7.25it/s] 79%|███████▉  | 93/117 [00:12<00:03,  7.26it/s] 80%|████████  | 94/117 [00:13<00:03,  7.27it/s] 81%|████████  | 95/117 [00:13<00:03,  7.27it/s] 82%|████████▏ | 96/117 [00:13<00:02,  7.27it/s] 83%|████████▎ | 97/117 [00:13<00:02,  7.27it/s] 84%|████████▍ | 98/117 [00:13<00:02,  7.27it/s] 85%|████████▍ | 99/117 [00:13<00:02,  7.28it/s] 85%|████████▌ | 100/117 [00:13<00:02,  7.22it/s] 86%|████████▋ | 101/117 [00:14<00:02,  7.24it/s] 87%|████████▋ | 102/117 [00:14<00:02,  7.25it/s] 88%|████████▊ | 103/117 [00:14<00:01,  7.27it/s] 89%|████████▉ | 104/117 [00:14<00:01,  7.26it/s] 90%|████████▉ | 105/117 [00:14<00:01,  7.27it/s] 91%|█████████ | 106/117 [00:14<00:01,  7.27it/s] 91%|█████████▏| 107/117 [00:14<00:01,  7.27it/s] 92%|█████████▏| 108/117 [00:15<00:01,  7.26it/s] 93%|█████████▎| 109/117 [00:15<00:01,  7.27it/s] 94%|█████████▍| 110/117 [00:15<00:00,  7.28it/s] 95%|█████████▍| 111/117 [00:15<00:00,  7.28it/s] 96%|█████████▌| 112/117 [00:15<00:00,  7.28it/s] 97%|█████████▋| 113/117 [00:15<00:00,  7.28it/s] 97%|█████████▋| 114/117 [00:15<00:00,  7.28it/s] 98%|█████████▊| 115/117 [00:15<00:00,  7.28it/s] 99%|█████████▉| 116/117 [00:16<00:00,  7.29it/s]100%|██████████| 117/117 [00:16<00:00,  7.21it/s]
Test MSE Loss: 0.0004362613835837692 - Test mean MSE Loss: 0.20940545201301575 - Test sum MSE Loss: 24.500438690185547
